app/controllers/error_logs_controller.rb

SELECT "error_logs".* FROM "error_logs" WHERE "error_logs"."output" IS NOT NULL ORDER BY "error_logs"."view_count" DESC LIMIT $1  [["LIMIT", 5]]
---
  def new
    @error_log = ErrorLog.new
    @popular   = ErrorLog.where.not(output: nil).order(view_count: :desc).limit(5)

INSERT INTO "error_logs" ("input", "output", "category", "ip_hash", "view_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @error_log = ErrorLog.new(
      input:      params[:error_log][:input],
      ip_hash:    Digest::SHA256.hexdigest(request.remote_ip),
      view_count: 0
    )

    if @error_log.save

SELECT "error_logs".* FROM "error_logs" WHERE "error_logs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "error_logs" SET "view_count" = COALESCE("view_count", 0) + $1 WHERE "error_logs"."id" = $2  [["view_count", 1], ["id", 1]]
---
  def show
    @error_log = ErrorLog.find(params[:id])
    @error_log.increment!(:view_count)

SELECT "error_logs".* FROM "error_logs" WHERE "error_logs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "error_logs" SET "output" = $1, "updated_at" = $2 WHERE "error_logs"."id" = $3
---
  def stream
    @error_log = ErrorLog.find(params[:id])

    response.headers["Content-Type"]      = "text/event-stream"
    response.headers["Cache-Control"]     = "no-cache"
    response.headers["X-Accel-Buffering"] = "no"
    response.headers["Connection"]        = "keep-alive"

    sse = ActionController::Live::SSE.new(response.stream, retry: 300)

    begin
      generator  = ErrorLogGenerator.new(@error_log.input)
      raw_json   = ""

      generator.stream do |chunk|
        raw_json += chunk
        sse.write({ type: "chunk" }.to_json)
      end

      cleaned = raw_json.strip.gsub(/\A```(?:json)?\n?/, "").gsub(/\n?```\z/, "")
      data    = JSON.parse(cleaned)

      @error_log.update!(output: data["error_log"])